# encoding: utf-8
class String
  @@hchars = ' !"#$%&\'()*+,-./0123456789:;<=>?@ABCDEFGHIJKLMNOPQRSTUVWXYZ\[\\]^_`abcdefghijklmnopqrstuvwxyz{|}~'
  @@fchars = '　！＂＃＄％＆＇（）＊＋，－．／０１２３４５６７８９：；＜＝＞？＠ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺ［＼］＾＿｀ａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ｛｜｝～'
  @@hhash  = {' '=>'　','!'=>'！','"'=>'＂','#'=>'＃','$'=>'＄','%'=>'％','&'=>'＆','\''=>'＇','('=>'（',')'=>'）','*'=>'＊','+'=>'＋',','=>'，','-'=>'－','.'=>'．','/'=>'／','0'=>'０','1'=>'１','2'=>'２','3'=>'３','4'=>'４','5'=>'５','6'=>'６','7'=>'７','8'=>'８','9'=>'９',':'=>'：',';'=>'；','<'=>'＜','='=>'＝','>'=>'＞','?'=>'？','@'=>'＠','A'=>'Ａ','B'=>'Ｂ','C'=>'Ｃ','D'=>'Ｄ','E'=>'Ｅ','F'=>'Ｆ','G'=>'Ｇ','H'=>'Ｈ','I'=>'Ｉ','J'=>'Ｊ','K'=>'Ｋ','L'=>'Ｌ','M'=>'Ｍ','N'=>'Ｎ','O'=>'Ｏ','P'=>'Ｐ','Q'=>'Ｑ','R'=>'Ｒ','S'=>'Ｓ','T'=>'Ｔ','U'=>'Ｕ','V'=>'Ｖ','W'=>'Ｗ','X'=>'Ｘ','Y'=>'Ｙ','Z'=>'Ｚ','\['=>'［','\\'=>'＼',']'=>'］','^'=>'＾','_'=>'＿','`'=>'｀','a'=>'ａ','b'=>'ｂ','c'=>'ｃ','d'=>'ｄ','e'=>'ｅ','f'=>'ｆ','g'=>'ｇ','h'=>'ｈ','i'=>'ｉ','j'=>'ｊ','k'=>'ｋ','l'=>'ｌ','m'=>'ｍ','n'=>'ｎ','o'=>'ｏ','p'=>'ｐ','q'=>'ｑ','r'=>'ｒ','s'=>'ｓ','t'=>'ｔ','u'=>'ｕ','v'=>'ｖ','w'=>'ｗ','x'=>'ｘ','y'=>'ｙ','z'=>'ｚ','{'=>'｛','|'=>'｜','}'=>'｝','~'=>'～',}
  @@fhash  = {'　'=>' ','！'=>'!','＂'=>'"','＃'=>'#','＄'=>'$','％'=>'%','＆'=>'&','＇'=>'\'','（'=>'(','）'=>')','＊'=>'*','＋'=>'+','，'=>',','－'=>'-','．'=>'.','／'=>'/','０'=>'0','１'=>'1','２'=>'2','３'=>'3','４'=>'4','５'=>'5','６'=>'6','７'=>'7','８'=>'8','９'=>'9','：'=>':','；'=>';','＜'=>'<','＝'=>'=','＞'=>'>','？'=>'?','＠'=>'@','Ａ'=>'A','Ｂ'=>'B','Ｃ'=>'C','Ｄ'=>'D','Ｅ'=>'E','Ｆ'=>'F','Ｇ'=>'G','Ｈ'=>'H','Ｉ'=>'I','Ｊ'=>'J','Ｋ'=>'K','Ｌ'=>'L','Ｍ'=>'M','Ｎ'=>'N','Ｏ'=>'O','Ｐ'=>'P','Ｑ'=>'Q','Ｒ'=>'R','Ｓ'=>'S','Ｔ'=>'T','Ｕ'=>'U','Ｖ'=>'V','Ｗ'=>'W','Ｘ'=>'X','Ｙ'=>'Y','Ｚ'=>'Z','［'=>'[','＼'=>'\\','］'=>']','＾'=>'^','＿'=>'_','｀'=>'`','ａ'=>'a','ｂ'=>'b','ｃ'=>'c','ｄ'=>'d','ｅ'=>'e','ｆ'=>'f','ｇ'=>'g','ｈ'=>'h','ｉ'=>'i','ｊ'=>'j','ｋ'=>'k','ｌ'=>'l','ｍ'=>'m','ｎ'=>'n','ｏ'=>'o','ｐ'=>'p','ｑ'=>'q','ｒ'=>'r','ｓ'=>'s','ｔ'=>'t','ｕ'=>'u','ｖ'=>'v','ｗ'=>'w','ｘ'=>'x','ｙ'=>'y','ｚ'=>'z','｛'=>'{','｜'=>'|','｝'=>'}','～'=>'~',}
	
	def tmpl(hash)
	  SimpleTemplate.new.format_string(self, hash)
	end	
	
	def integer?
		self =~ /^[\d]+$/
	end
	
  # 截取字符串
  def trunc(size=5)
    if self.size > size
      self[0..size]+'...'
    else
      self
    end
  end
  
  # 全角
  def to_full_width
    self.gsub(/([#{@@hchars}])/){|c|@@hhash[c]}
  end
  
  # 半角
  def to_half_width
    self.gsub(/([#{@@fchars}])/){|c|@@fhash[c]}
  end
  
  # 转换以%u代表的unicode码为可识别的字符
  def unescape_unicode
    self.gsub(/(%u\w+)/){|e| [e[2..-1].hex].pack("U")}
  end

end

class SimpleTemplate 
  SIMPLE_TEMPLATE_MATCH = /(\\\\)?\{\{([^\}]+)\}\}/
  
  def format_string(string, values={})
    string.gsub(SIMPLE_TEMPLATE_MATCH) do
      escaped, pattern, key = $1, $2, $2.to_sym

      if escaped
        pattern
      elsif !values.include?(key)
        raise ArgumentError.new("key: #{key} should be in #{values.inspect}")
      else
        values[key].to_s
      end
    end
  end
end
